kjitender469/stm32f0xx-driver/drivers/Src/stm32f030xx_i2c_driver.c
/*
 * stm32f030xx_i2c_driver.c
 *
 *  Created on: 24-Jun-2020
 *      Author: Jitender Kumar
 */


#include "stm32f030xx.h"


uint16_t HCLK_PreScaler[9] = {2, 4, 8, 16, 32, 64, 128, 256, 512};
uint8_t PCLK_PreScaler[8] = {2, 4, 8, 16};


static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx);
static void I2C_ExecuteAddressPhase(I2C_RegDef_t *pI2Cx, uint8_t slave_address);



/**********************************************************************************************************
 * @fn				- I2C_GenerateStartCondition
 *
 * @brief			- helper function for function I2C_masterSendData()
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR2 |= (1 << I2C_CR2_START);
}



/**********************************************************************************************************
 * @fn				- I2C_GenerateStartCondition
 *
 * @brief			- helper function for function I2C_masterSendData()
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR2 |= (1 << I2C_CR2_STOP);
}




/**********************************************************************************************************
 * @fn				- I2C_ExecuteAddressPhase
 *
 * @brief			- helper function for function I2C_masterSendData()
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
static void I2C_ExecuteAddressPhase(I2C_RegDef_t *pI2Cx, uint8_t slave_address)
{
	// left shift slave address by 1 to make space for r/w bit
	slave_address = slave_address << 1;
	slave_address &= ~(1);		// slave address is slave address + r/w bit = 0
	pI2Cx->TXDR = slave_address;
}



/*
 * 	Peripheral Clock Setup
 * */
/**********************************************************************************************************
 * @fn				- I2C_PeriClockControl
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		if(pI2Cx == I2C1)
		{
			I2C1_PCLK_EN();
		}else if(pI2Cx == I2C2)
		{
			I2C2_PCLK_EN();
		}
	}
	else
	{
		if(pI2Cx == I2C1)
		{
			I2C1_PCLK_DI();
		}else if(pI2Cx == I2C2)
		{
			I2C2_PCLK_DI();
		}
	}
}


uint8_t RCC_GetOutputClock(void)
{
	return 0;
}

/*
 * Function for calculating APB Peripheral clock
 * */
uint32_t RCC_GetPCLKValue(void)
{
	uint32_t pclk1, SystemClk;

	uint8_t clksrc, temp, hpre, ppre;
	clksrc = (RCC->CFGR >> 2) & 0x3;

	if(clksrc < 0)
	{
		SystemClk = 8000000;
	}else if(clksrc == 1)
	{
		SystemClk = 8000000;
	}else if(clksrc == 2)
	{
		SystemClk = RCC_GetOutputClock();
	}

	// Read HPRE Value here
	// HCLK Prescaler
	temp = (RCC->CFGR >> 4) & 0xF;

	if(temp < 8)
	{
		hpre = 1;
	}else
	{
		hpre = HCLK_PreScaler[temp - 8];
	}

	// PCLK Prescaler - PPRE
	temp = (RCC->CFGR >> 8) & 0x7;

	if(temp < 4)
	{
		ppre = 1;
	}else
	{
		ppre = PCLK_PreScaler[temp - 4];
	}

	pclk1 = (SystemClk / hpre) / ppre;

	return pclk1;
}



/*
 * 	Init and De-Init
 * */

/**********************************************************************************************************
 * @fn				- I2C_Init
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			- ** Initialization has to be done when I2C Peripheral is Disable.
 * 					- Configure the Mode(Standard or Fast or Fast+)
 * 					- Configure the Speed of the Serial Clock(SCLK)
 * 					- Configure the Device Address
 * 					- Enable the ACK
 * 					- Configure the Rise Time for I2C pins
 *
 * *********************************************************************************************************/
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
	uint32_t tempreg = 0;

	// enable the clock for I2Cx peripheral
	I2C_PeriClockControl(pI2CHandle->pI2Cx, ENABLE);

	//tempreg =;

	// Configure the NACKIE. Not acknowledge received Interrupt enable. By default this is disabled.

	// Configure the device own address
	tempreg = pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
	pI2CHandle->pI2Cx->OAR1 |= tempreg;

	// Enable the OA1
	pI2CHandle->pI2Cx->OAR1 |= (1 << 15);

	// Configure the I2C timing here
	pI2CHandle->pI2Cx->TIMINGR = pI2CHandle->I2C_Config.I2C_SCLTiming;

	// Enable Interrupts

	// Error Interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ERRIE);

	// Transfer Complete Interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TCIE);

	// Stop Detection Interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_STOPIE);

	// NACK received interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_NACKIE);

	// TX interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TXIE);

	// Enable AUTOEND
	pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_AUTOEND);
}



/**********************************************************************************************************
 * @fn				- I2C_DeInit
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
	if(pI2Cx == I2C1)
	{
		I2C1_REG_RESET();
	}else if(pI2Cx == I2C2)
	{
		I2C2_REG_RESET();
	}
}



/**********************************************************************************************************
 * @fn				- I2C_SlaveAddressConfig
 *
 * @brief			- Configure the I2C Slave address in I2C_OA1
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_SlaveAddressConfig(I2C_RegDef_t *pI2Cx, uint8_t slave_address)
{
	// Configure the OA1. OA1 can be configured either in 7-bit mode (by default) or in 10-bit addressing mode.
	//pI2Cx->OAR1 |= (  );

	// Enable the OA1
	pI2Cx->OAR1 |= ( 1 << 15 );

	// Setting the slave address
	pI2Cx->OAR1 |= ( slave_address << 1 );

