kjitender469/stm32f0xx-driver/drivers/Src/stm32f030xx_i2c_driver.c
	// Enable GCEN Bit
	I2C_GCEN_Control(I2C1, ENABLE);
}




/*
 * Data send and receive
 * */
/**********************************************************************************************************
 * @fn				- I2C_MasterSendData
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t length, uint8_t slave_address)
{
	//Wait until I2C is busy.
	while(I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == SET);

	// Set the slave address
	pI2CHandle->pI2Cx->CR2 |= (slave_address << ( I2C_CR2_SADD + 1 ) );

	// Set the number of bytes to be transfered
	pI2CHandle->pI2Cx->CR2 |= (length << I2C_CR2_NBYTES);

	// Enable General Call GCEN
	//pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_GCEN );

//	// Enable Interrupts
//
//	// Error Interrupt
//	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ERRIE);
//
//	// Transfer Complete Interrupt
//	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TCIE);
//
//	// Stop Detection Interrupt
//	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_STOPIE);
//
//	// NACK received interrupt
//	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_NACKIE);
//
//	// TX interrupt
	pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TXIE);
//
	// Enable AUTOEND
//	pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_AUTOEND);

	// Enable RELOAD
	//pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_RELOAD);

	// Generate start condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	// Set TC flag (alpha)


	// Confirm that start generation is completed by checking the SB flag.
	// Note: Until SB is cleared SCL will be stretched (pull to LOW)
	/*
	 * Not Applicable
	 * */

	// setting no of bytes transferred in NBYTE register
	//pI2CHandle->pI2Cx->CR2 |= (length << I2C_CR2_NBYTES);

	// Send the address of the slave with r/rw bit set to w(0) ( total 8 bits )
	//I2C_ExecuteAddressPhase(pI2CHandle->pI2Cx, slave_address);

	// Confirm that address phase is completed by checking the ADDR flag in the SR register

	// Stop generation
	//pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_STOP );

	// send data until length become zero
	while(length > 0)
	{
		/*
		 * This flag is set by hardware when the I2C_TXDR register is empty.
		 * */
		while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TXIS) == RESET ); 		// wait till TXIS is RESET
		pI2CHandle->pI2Cx->TXDR = *pTxBuffer;
		pTxBuffer++;
		length--;


		// Generate start condition
		//I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		//while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TXE) == SET ); 		// wait till TXE is reset

		// wait until stop condition is not detected i.e STOPF flag is SET
		//while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_STOPF) == SET );

		// Clear the STOP flag by setting STOPCF bit
		//pI2CHandle->pI2Cx->ICR = (1 << I2C_ICR_STOPCF);

		//while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TCR) == SET ); 		// wait till TCR is set



		//pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_STOP );
	}

	// when length becomes zero wait for TXE = 1 and BTF = 1
	// In stm32f0308 wait until TC set to 0
	//while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC) );

	//I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

	// wait until stop condition is not detected i.e STOPF flag is SET
	//while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_STOPF) == SET );

	// Clear the STOP flag by setting STOPCF bit
	//pI2CHandle->pI2Cx->ICR = (1 << I2C_ICR_STOPCF);

	// Generate start condition
	//I2C_GenerateStartCondition(pI2CHandle->pI2Cx);
}



/**********************************************************************************************************
 * @fn				- I2C_MasterReceiveData
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t length, uint8_t slave_address)
{
	// Check if I2C bus is busy or not
	// Wait until I2C is busy.
	while(I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BUSY) == SET);

	// Set the I2C mode (Whether Read or Write)
	pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_RD_WRN );

	// Send the address of the slave with r/w bit set to R(1) (total 8 bits)
	// Set the slave address
	pI2CHandle->pI2Cx->CR2 |= (slave_address << ( I2C_CR2_SADD + 1 ) );

	// Set the number of bytes to be received
	pI2CHandle->pI2Cx->CR2 |= (length << I2C_CR2_NBYTES);

	// Generate the Start Condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	// wait until the address phase is completed by checking the ADDR flag in the SR1

	// Read the data until length becomes zero
	for( uint32_t i = length; i > 0; i-- )
	{
		/*
		 * This flag is set by hardware when I2C_RXDR is ready to be read.
		 * */
		 while( I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_RXNE) == RESET ); 		// wait till RXNE is RESET

		 // Read the data from data register into buffer
		 *pRxBuffer = pI2CHandle->pI2Cx->RXDR;
		 pRxBuffer++;
	}
}



/**********************************************************************************************************
 * @fn				- I2C_MasterSendData_IT
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
uint8_t I2C_MasterSendData_IT(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t length, uint8_t slave_address, uint8_t SR)
{
	uint8_t busy_state = pI2CHandle->TxRxState;

	if( (busy_state != I2C_BUSY_IN_TX) && (busy_state != I2C_BUSY_IN_RX) )
	{
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = length;
		//pI2CHandle->pI2Cx->CR2 |= (length << I2C_CR2_NBYTES);
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DeviceAddress = slave_address;
		// Set the slave address
		//pI2CHandle->pI2Cx->CR2 |= (slave_address << ( I2C_CR2_SADD + 1 ) );
		pI2CHandle->SR = SR;

		// Generate start condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		// Enable Transmit Interrupt
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_TXIE );

