kjitender469/stm32f0xx-driver/drivers/Src/stm32f030xx_i2c_driver.c
		// Enable Error Interrupt
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_ERRIE );
	}
	return busy_state;
}



/**********************************************************************************************************
 * @fn				- I2C_MasterReceiveData_IT
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
uint8_t I2C_MasterReceiveData_IT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t length, uint8_t slave_address, uint8_t SR)
{
	uint8_t busy_state = pI2CHandle->TxRxState;

	if( (busy_state != I2C_BUSY_IN_TX) && (busy_state != I2C_BUSY_IN_RX) )
	{
		pI2CHandle->pRxBuffer = pRxBuffer;
		pI2CHandle->RxLen = length;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->DeviceAddress = slave_address;
		pI2CHandle->SR = SR;

		// Generate start condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		// Generate start condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		// Enable Transmit Interrupt
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_TXIE );

		// Enable Error Interrupt
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_ERRIE );
	}
	return busy_state;
}



/**********************************************************************************************************
 * @fn				- I2C_SlaveSendData
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_SlaveSendData(I2C_RegDef_t *pI2C, uint8_t data)
{
	pI2C->TXDR = data;
}



/**********************************************************************************************************
 * @fn				- I2C_SlaveReceiveData
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2C)
{
	return (uint8_t)pI2C->TXDR;
}



/*
 * 	Read the status of flag specified
 * */

/**********************************************************************************************************
 * @fn				- I2C_GetFlagStatus
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t flagName)
{
	if( pI2Cx->ISR & flagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}



/*
 * Other Peripheral Control APIs
 * */

/**********************************************************************************************************
 * @fn				- I2C_PeripheralControl
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
	}else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
	}
}



/**********************************************************************************************************
 * @fn				- I2C_GCEN_Control
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_GCEN_Control(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_GCEN);
	}else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_GCEN);
	}
}



/**********************************************************************************************************
 * @fn				- I2C_SBC_Control
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_SBC_Control(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_SBC);
	}else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_SBC);
	}
}



/**********************************************************************************************************
 * @fn				- I2C_NOSTRETCH_Control
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_NOSTRETCH_Control(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if(EnOrDi == DISABLE)
	{
		// Setting NOSTRETCH bit will disable NOSTRETCH
		pI2Cx->CR1 |= (1 << I2C_CR1_NOSTRETCH);
	}else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_NOSTRETCH);
	}
}



/**********************************************************************************************************
 * @fn				- I2C_ManageAcking
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if( EnOrDi == I2C_ACK_ENABLE)
	{
		// Enable the ACK
		pI2Cx->CR2 &= ~( 1 << I2C_CR2_NACK ); 		// This will disable the NACK means ACK is send.
	}else
	{
		// Disable the ACK
		pI2Cx->CR2 |= ( 1 << I2C_CR2_NACK ); 		// This will enable the NACK means ACK is not send.
	}
}



/**********************************************************************************************************
 * @fn				- I2C_IRQInterruptConfig
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		// program ISER register
		*NVIC_ISER |= (1 << IRQNumber);

	}else
	{
		// program ISER register
		*NVIC_ICER |= (1 << IRQNumber);
	}
}



/**********************************************************************************************************
 * @fn				- I2C_IRQPriorityConfig
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_IRQPriorityConfig( uint8_t IRQNumber, uint32_t IRQPriority)
{
	// find out the IPR register
	uint8_t IPRx = IRQNumber / 4;				/* To identify which IPR register */
	uint8_t IPRx_section = IRQNumber % 4;		/* To identify which section of IPR register is to program. Each section is of 8 bits. */

