kjitender469/stm32f0xx-driver/drivers/Src/stm32f030xx_i2c_driver.c
	uint8_t shift_amount = (8 * IPRx_section) + (8 - NO_PR_BITS_IMPLEMENTED);	/* In Cortex M0 2 bits are implemented. Bit[7:6] bits [5:0] read as zero and ignore writes. */
	*(NVIC_PR_BASE_ADDR + IPRx) |= ( IRQPriority << shift_amount );
}



/**********************************************************************************************************
 * @fn				- I2C_EV_IRQHandling
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	// Interrupt handling for both master and slave device

	uint32_t temp1, temp1_status;
//	temp2, temp3, temp4, temp5, temp6, temp7;
//	uint32_t temp1_status, temp2_status, temp3_status, temp4_status, temp5_status, temp6_status;

	// check whether Interrupt is actually enable or not.
	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_RXIE );
//	temp2 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_TXIE );
//	temp3 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_ADDRIE );
//	temp4 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_NACKIE );
//	temp5 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_STOPIE );
//	temp6 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_TCIE );
//	temp7 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_ERRIE );

	// get the corresponding flag in status register
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_RXNE );
//	temp2_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_TXIS );
//	temp3_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_ADDR );
//	temp4_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_NACKF );
//	temp5_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_STOPF);
//	temp6_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_TC );
	//temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_ );

	// Handle for interrupt generated by RXNE event
	if( temp1 && temp1_status )
	{
		/*
		 * By default, it operates in slave mode. The interface automatically switches from slave to master
		 * when it generates a START condition, and from master to slave if an arbitration loss or a STOP
		 * generation occurs
		 * */
		if( pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_START ) )
		{
			// If start condition detected that means Device is in Master Mode
			// confirm that RXNE flag is set
			if(pI2CHandle->RxLen > 0)
			{
				if( pI2CHandle->TxRxState == I2C_BUSY_IN_RX )
				{
					*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->RXDR;
					pI2CHandle->pRxBuffer++;
					pI2CHandle->RxLen--;
				}
			}

			// close the I2C data reception and notify the application

			// 1. Generate the stop condition
			if( pI2CHandle->SR == I2C_DISABLE_SR )
				I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

			// 2. Close the I2C Rx
			I2C_CloseReceiveData(pI2CHandle);

			// 3. Notify the application
			I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_RX_CMPLT);

		}else
		{
			// Slave Mode confirm
			if( pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_DIR ) )
			{
				// Device in transmitter mode confirmed

				I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_REQ);
			}
		}

	}

	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_TXIE );
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_TXIS );

	// Handle for interrupt generated by TXIS event
	if( temp1 && temp1_status )
	{
		/*
		 * By default, it operates in slave mode. The interface automatically switches from slave to master
		 * when it generates a START condition, and from master to slave if an arbitration loss or a STOP
		 * generation occurs
		 * */
		if( pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_START ) )
		{
			// If start condition detected that means Device is in Master Mode

			/*
			 * confirm that TXIS flag is set. This means the I2C_TXDR register is empty and the data to be
			 * transmitted must be written in the I2C_TXDR register. It is cleared when the next data to be
			 * sent is written in the I2C_TXDR register
			 * */
			if( pI2CHandle->TxRxState == I2C_BUSY_IN_TX )
			{
				if( pI2CHandle->TxLen > 0 )
				{
					// Load the data into DR
					pI2CHandle->pI2Cx->TXDR = *(pI2CHandle->pTxBuffer);

					// Decrement the TxLen
					pI2CHandle->TxLen--;

					// Increment the buffer address
					pI2CHandle->pTxBuffer++;
				}
			}

			// close the I2C data transmission and notify the application

			// 1. Generate the stop condition
			if( pI2CHandle->SR == I2C_DISABLE_SR )
				I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

			// 2. Close the I2C Tx
			I2C_CloseSendData(pI2CHandle);

			// 3. Notify the application
			I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);

		}else{
			// Device is in Master Mode
			if( pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_DIR ) )
			{
				// Device in transmitter mode confirmed

				I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_REQ);
			}
		}
	}

	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_ADDRIE );
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_ADDR );

	// Handle for interrupt generated by ADDR event
	if( temp1 && temp1_status )
	{
		// confirm that ADDR flag is set

		// Get the received Address
		uint8_t address = pI2CHandle->pI2Cx->ISR & 0x4F;

		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_ADDRCF );
	}

	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_NACKIE );
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_NACKF );

	// Handle for interrupt generated by NACKF event
	if( temp1 && temp1_status )
	{
		// confirm that NACKF flag is set
	}

	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_STOPIE );
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_STOPF );

	// Handle for interrupt generated by STOPF event
	if( temp1 && temp1_status )
	{
		// confirm that STOPF flag is set
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_STOPCF );
		I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_STOP);
	}

	temp1 = pI2CHandle->pI2Cx->CR1 & ( 1 << I2C_CR1_TCIE );
	temp1_status = pI2CHandle->pI2Cx->ISR & ( 1 << I2C_ISR_TC );

	// Handle for interrupt generated by TC event
	if( temp1 && temp1_status )
	{
		// confirm that TC flag is set
	}
}



/**********************************************************************************************************
 * @fn				- I2C_ER_IRQHandling
 *
 * @brief			-
 *
 * @param[in]		-
 * @param[in]		-
 *
 * @return			-
 *
 * @Note			-
 *
 * *********************************************************************************************************/
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	uint32_t temp1,temp2;

	// know the status of ERRIE control bit in the CR1
	temp2 = ( pI2CHandle->pI2Cx->CR1 ) & ( 1 << I2C_CR1_ERRIE );

