kjitender469/stm32f0xx-driver/drivers/Src/stm32f030xx_i2c_driver.c
	/*
	 * Check for bus Error
	 * */
	temp1 = ( pI2CHandle->pI2Cx->ISR ) & ( 1 << I2C_ISR_BERR );

	if( temp1 && temp2 )
	{
		// Bus error is confirmed

		// clear the bus error
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_BERRCF );

		// Notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_BERR);
	}

	/*
	 * Check for arbitration lost error
	 * */
	temp1 = ( pI2CHandle->pI2Cx->ISR ) & ( 1 << I2C_ISR_ARLO );

	if( temp1 && temp2 )
	{
		// Arbitration lost error is confirmed

		// clear the arbitration lost error
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_ARLOCF );

		// Notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_ARLO);
	}

	/*
	 * Check for ACK failure error
	 * */
	temp1 = ( pI2CHandle->pI2Cx->ISR ) & ( 1 << I2C_ISR_NACKF );

	if( temp1 && temp2 )
	{
		// ACK failure error is confirmed

		// clear the ACK failure error
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_NACKCF );

		// Notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_NACKF);
	}

	/*
	 * Check for overrun/underrun error
	 * */
	temp1 = ( pI2CHandle->pI2Cx->ISR ) & ( 1 << I2C_ISR_OVR );

	if( temp1 && temp2 )
	{
		// overrun/underrun error is confirmed

		// clear the overrun/underrun error
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_OVRCF );

		// Notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_OVR);
	}

	/*
	 * Check for timeout error
	 * */
	temp1 = ( pI2CHandle->pI2Cx->ISR ) & ( 1 << I2C_ISR_TIMEOUT );

	if( temp1 && temp2 )
	{
		// timeout error is confirmed

		// clear the timeout error
		pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_TIMOUTCF );

		// Notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_TIMEOUT);
	}
}



void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle)
{
	// Disable the interrupt
	pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_RXIE );

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;
}



void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
	// Disable the interrupt
	pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_TXIE );

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pTxBuffer = NULL;
	pI2CHandle->TxLen = 0;
}



void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if( EnOrDi == ENABLE )
	{
		pI2Cx->CR1 |= ( 1 << I2C_CR1_TXIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_RXIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_ADDRIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_NACKIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_TCIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_ERRIE );
		pI2Cx->CR1 |= ( 1 << I2C_CR1_STOPIE );
	}else
	{
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_TXIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_RXIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_ADDRIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_NACKIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_TCIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_ERRIE );
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_STOPIE );
	}
}





